{"data":{"site":{"siteMetadata":{"siteUrl":"http://mamykin.com","disqusShortname":"mamykin-com"}},"post":{"frontmatter":{"permalink":"/posts/running-x-apps-on-mac-with-docker/","title":"How to run dockerized X Windows apps on macOS","author":"Kliment Mamykin","date":"2021-05-15","image":"","tags":["docker","Docker for Mac","macOS","XWindows","X11","XQuartz"]},"content":{"type":"Markdown","markdown":"\n## TLDR\n\n* Install XQuartz `brew install --cask xquartz`, reboot\n* `xhost +localhost` to enable XClients to connect to XServer over local TCP/IP connections\n* `docker run -it --rm --env=\"DISPLAY=host.docker.internal:0\" ...`\n\n## Motivation\n\nThere are numerous examples how to run [X-Window](https://en.wikipedia.org/wiki/X_Window_System) applications in a docker container, but very few of the examples work on macOS using \"Docker for Mac\" product.\nI discovered that trying to work through the tutorials of [ROS2 (Robot Operating System)](https://docs.ros.org/en/foxy/index.html) on my Mac (Big Sur, M1 CPU).\nWhile most of ROS processes work perfectly well in docker, some essential GUI applications such as rqt and rviz need to connect to XServer process running on the host machine.\nWhat follows is a list of steps to make this setup work using \"Docker for Mac\" and XQuartz.\n\n## Install XQuartz\n\nThe first step is to install XQuartz application, which implements X11 system on macOS. \nYou can either [download dmg from here](https://www.xquartz.org/) or install XQuartz using Homebrew (my preferred method). \nPlease note that Homebrew has changed the command to install \"cask\" packaged apps, and the correct command to install is available at https://formulae.brew.sh/cask/xquartz#default\n\n```bash\nbrew update # optional\nbrew install --cask xquartz\n```\n\nAfter the installation completes, start XQuartz application, select Preferences menu, go to the “Security” tab and make sure you’ve got \n“Allow connections from network clients” checked:\n\n![XQuartz Preferences](img/XQuartz_Preferences.png)\n\nAfter that **quit and restart XQuartz application**. \nIn fact, I had to restart my machine after which things started magically working, so it may or may not be a factor. \nA quick test of XQuartz is to run `xeyes` from the command line, and you should see a pair of googly eyes watching the position of the mouse.\n\n### Permissions control with xhost command\n\nThere are several mechanisms to manage access control of an X server - [xhost and xauth](https://tldp.org/HOWTO/Remote-X-Apps-6.html).\n`xhost` is a simple mechanism to have an IP based access control, and it's good enough for non-production use. \nNote that the access control settings set by `xhost` will only persist while XQuartz application is running.\nRestarting XQuartz application resets the access control to the most restrictive mode (equivalent to `xhost -` with no authorized clients), \nand it's a good idea to quit XQuartz in the end.\n\nQuick reference for working with [xhost](https://linux.die.net/man/1/xhost):\n\n- `xhost` prints the current mode and the list of authorized clients\n- `xhost +` disables access control and allows any client from the network to connect to XServer.\n- `xhost -` enables access control and allows only authorized clients to connect\n- `xhost +localhost` adds localhost to the list of authorized clients, allowing only local processes to connect\n\nFor our purpose it sufficient to run `xhost +localhost` to allow docker process to connect to XQuartz XServer.\n\n## Run Docker\n\nTheoretically, all we need to do is to share `/tmp/.X11-unix` directory to allow X11 apps inside a container to communicate with the XServer on the host using Unix Domain Sockets (UDS). \nThis approach is described in multiple articles available on this topic, just search for \"how to run GUI/X11 apps in docker\". \n\nUnfortunately this approach will not work when using \"Docker for Mac\". \nThere is a [long-standing issue](https://github.com/docker/for-mac/issues/483) for [Docker for Mac](https://docs.docker.com/docker-for-mac/install/) \nthat makes Unix style sockets non-functional between the host and a container. \nThat issue is related to docker's `osxfs` filesystem driver implementation, and was closed with 'will not fix' resolution.\nThe Docker Desktop 2.4.0.0 release [switched from `osxfs` to gRPC-FUSE](https://docs.docker.com/docker-for-mac/release-notes/#docker-desktop-community-2400) file sharing driver.\nHowever, after a quick test, I confirmed the issue has not been fixed in the gRPC-FUSE implementation either. \n\nThe workaround for this issue is to use TCP sockets for the XSystem communication instead of Unix Domain Sockets. \nIt is [not as](ttps://blog.myhro.info/2017/01/benchmarking-ip-and-unix-domain-sockets-for-real) [performant](https://blog.myhro.info/2017/01/benchmarking-ip-and-unix-domain-sockets-for-real) \nas connecting over UDS, but XSystem was designed to work over the network.\nThe only trick to make this work is to set `DISPLAY` environment variable inside the container to point at the host display, \nwhich is addressable as [`host.docker.internal:0`](https://docs.docker.com/docker-for-mac/networking/).\n\n## Quick test\n\nWith the following Dockerfile \n```Dockerfile\nFROM ubuntu:focal\n\nRUN apt-get update \\\n    && apt-get install -y --no-install-recommends \\\n        x11-apps\n\nCMD [\"xeyes\"]\n```\n\nBuild it `docker build -t x11-apps .` and run it \n```bash\ndocker run -it --rm --env=\"DISPLAY=host.docker.internal:0\" x11-apps xeyes\n```\n\nIf you got the following output, you probably need to start/restart XQuartz, start it now with `xhost +localhost`.\n```\nNo protocol specified\nError: Can't open display: host.docker.internal:0\n```\nRight now this Dockerfile installs only x11-apps, but you would need to install the actual packages you want to use to the image.\n\nOne outstanding issue here is GPU support: for the apps requesting GPU context (e.g. rviz for ROS) I have not gotten this to work. \nIf you have an idea how to approach that, let me know in the comments.\n\n### See also\n* [http://wiki.ros.org/docker/Tutorials/GUI](http://wiki.ros.org/docker/Tutorials/GUI) - Linux centric, does not work on Mac\n* https://github.com/mviereck/x11docker - only supports Linux and Windows hosts, not Macs\n","notebook":null}}},"pageContext":{"permalink":"/posts/running-x-apps-on-mac-with-docker/"}}